Autodesk.Revit.UI.SplitButtonData.#ctor(System.String,System.String)
Constructs a new instance of SplitButtonData.
name: The internal name of the new button.
The user visible text seen on the new button.
Remarks:
This text will be displayed on the button if drop-down is empty. If sub-items are added,
then the split button will display the current PushButton's text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when null is passed for one or more arguments.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when an empty string is passed for one or more arguments.
Since: 2011

Autodesk.Revit.UI.SplitButtonData
This class contains information necessary to construct a split button in the Ribbon.
Since: 2011